In [1]:
import pandas as pd

In [2]:
#pd.__version__  > 1.5.3

In [3]:
l = [1,2,3,4]
s = pd.Series(l)
print(s)

0    1
1    2
2    3
3    4
dtype: int64

giving index from our side

In [4]:
s = pd.Series(data = ["Prachi", "Priyanka", "Shital"], index = [10,23,45])
print(s)

10      Prachi
23    Priyanka
45      Shital
dtype: object

series from dictionary

In [5]:
d = {45 : "Prachi", 23 : "Sanjana" , 10 : "sayali"}
s = pd.Series(d)
print(s)

45     Prachi
23    Sanjana
10     sayali
dtype: object

repeating a series

In [6]:
l = [1,2,3]
s = pd.Series(l).repeat(2)
print(s)

0    1
0    1
1    2
1    2
2    3
2    3
dtype: int64

repeating series with different indices

In [7]:
s = pd.Series(l).repeat(2).reset_index(drop=True)
print(s)

0    1
1    1
2    2
3    2
4    3
5    3
dtype: int64

In [8]:
s = pd.Series(l).repeat([2,4,6]).reset_index(drop=True)
print(s)

0     1
1     1
2     2
3     2
4     2
5     2
6     3
7     3
8     3
9     3
10    3
11    3
dtype: int64

accessing elements

accessing elements and slicing works same as we do in a list

aggregate of series

In [9]:
s = pd.Series([1,2,3,4,5,6,7])
s.agg([min,max,sum])

min     1
max     7
sum    28
dtype: int64

series absolute function

In [10]:
s = pd.Series([-1,2,3,-4,-5,6])
s.abs()

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

appending 2 series

In [11]:
s1 = pd.Series([1,2,3,4])
s2 = pd.Series([5,6,7,8])
s3 = s1.append(s2).reset_index(drop = True)
print(s3)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
dtype: int64

C:\Users\SNEHA\AppData\Local\Temp\ipykernel_2476\1256103655.py:3: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  s3 = s1.append(s2).reset_index(drop = True)

Astype function : similar to typecasting

In [12]:
s3.astype(float)

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
6    7.0
7    8.0
dtype: float64

between function : returns True for values in a specific range and False otherwise

In [13]:
s = pd.Series([1,34,53,23,76,89,44,57])
print(s)
s.between(50,100)

0     1
1    34
2    53
3    23
4    76
5    89
6    44
7    57
dtype: int64

0    False
1    False
2     True
3    False
4     True
5     True
6    False
7     True
dtype: bool

In [14]:
s2 = s.between(50,100)
print(s2)

0    False
1    False
2     True
3    False
4     True
5     True
6    False
7     True
dtype: bool

In [15]:
s2 = dict(s2)
x = []
#print(s)
for i in s2.keys():
    if s2[i]==True:
        x.append(i)
for i in x:
    print(s[i])

53
76
89
57

string functions:

upper and lower

In [16]:
s = pd.Series(['Prachi','Prajakta'])
print(s.str.upper())
print("-"*30)
print(s.str.lower())

0      PRACHI
1    PRAJAKTA
dtype: object
------------------------------
0      prachi
1    prajakta
dtype: object

len function

In [17]:
for i in s:
    print(len(i))

6
8

strip

In [18]:
s = pd.Series(['*Prajakta','Prachi*'])
print(s)
print("-"*30)
print(s.str.strip("*"))

0    *Prajakta
1      Prachi*
dtype: object
------------------------------
0    Prajakta
1      Prachi
dtype: object

split

In [19]:
s = pd.Series(['Prachi Shedge', 'Prajakta Salunkhe'])
print(s.str.split(" "))

0        [Prachi, Shedge]
1    [Prajakta, Salunkhe]
dtype: object

In [20]:
for i in s.str.split(" "):
    print(i[0])
print('-'*20)
for i in s.str.split(" "):
    print(i[1])

Prachi
Prajakta
--------------------
Shedge
Salunkhe

contains function :  Returns True if it contains said substring else returns false

In [21]:
print(s.str.contains('chi'))

0     True
1    False
dtype: bool

replace : replaces 1 substring with other

In [22]:
s = s.str.replace('chi','jakta')
print(s)

0      Prajakta Shedge
1    Prajakta Salunkhe
dtype: object

count : counts number of occurrences of a substring in each element

In [23]:
print(s.str.count('a'))

0    3
1    4
dtype: int64

startswith and endswith

In [24]:
print(s.str.startswith('Pra'))
print('-'*25)
print(s.str.endswith('dge'))

0    True
1    True
dtype: bool
-------------------------
0     True
1    False
dtype: bool

Find Function : returns index of start of substring if found and -1 if not found

In [25]:
s.str.find('dge')

0    12
1    -1
dtype: int64

converting series to list

In [26]:
s.to_list()

['Prajakta Shedge', 'Prajakta Salunkhe']

## Pandas Dataframe :  2 dimensional data

creating data frame from a list

In [27]:
l = ['Prachi','Prajakta']
print(pd.DataFrame(l))       # by default column name is a integer

          0
0    Prachi
1  Prajakta

In [28]:
l = [['Prachi','Shedge'],['Prajakta','Salunkhe'],["Vishal",'Gupta']]
print(pd.DataFrame(l))

          0         1
0    Prachi    Shedge
1  Prajakta  Salunkhe
2    Vishal     Gupta

creating dataframe using dictionary and giving names to columns

In [29]:
d = {'Name':['Prachi','Prajakta','Vishal'],'Surname': ['Shedge','Salunkhe','Gupta'],'Qualification':['BE','Mtech','MA']}
print(pd.DataFrame(d))

       Name   Surname Qualification
0    Prachi    Shedge            BE
1  Prajakta  Salunkhe         Mtech
2    Vishal     Gupta            MA

selecting only particular clolumns

In [30]:
print(pd.DataFrame(d)[['Name','Surname']])

       Name   Surname
0    Prachi    Shedge
1  Prajakta  Salunkhe
2    Vishal     Gupta

slicing dataframes

In [31]:
d = {'one':[1,2,3,4],
    'two' : [10,20,30,40],
    'three' :[100,200,300,400],
    'four' :[1000,2000,3000,4000]}
d2 = pd.DataFrame(d)
d2

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

loc function

In [32]:
d2.loc[0:2,'one':'three']       # first and last both terms are included, use index for rows and column names for index

   one  two  three
0    1   10    100
1    2   20    200
2    3   30    300

selecting particular rows/columns using loc

In [33]:
d2.loc[1,'two']

20

In [34]:
d2.loc[:,'two']

0    10
1    20
2    30
3    40
Name: two, dtype: int64

In [35]:
d2.loc[0]

one         1
two        10
three     100
four     1000
Name: 0, dtype: int64

In [36]:
d2.loc[[1,2],['two','three']]

   two  three
1   20    200
2   30    300

iloc function

In [37]:
d2.iloc[:2,0:2]    # here for rows we use index only but also for column we use index and here stop index is not included

   one  two
0    1   10
1    2   20

selecting particular rows/columns using iloc

In [38]:
d2.iloc[1:3,1:2]

   two
1   20
2   30

In [39]:
d2.iloc[:,1:2]

   two
0   10
1   20
2   30
3   40

In [40]:
d2.iloc[2]

one         3
two        30
three     300
four     3000
Name: 2, dtype: int64

In [41]:
d2.iloc[[0,1],[2,3]]

   three  four
0    100  1000
1    200  2000

slicing using conditions

In [42]:
d2[d2['two']>20]           # only those values that have values greater than 20 in column 'two'

   one  two  three  four
2    3   30    300  3000
3    4   40    400  4000

In [43]:
d2[d2['one']==3]

   one  two  three  four
2    3   30    300  3000

Column addittion

using list

In [44]:
d2['five'] = [11,22,33,44]
d2

   one  two  three  four  five
0    1   10    100  1000    11
1    2   20    200  2000    22
2    3   30    300  3000    33
3    4   40    400  4000    44

using series

In [45]:
d2['six']=pd.Series([55,66,77,88])
d2

   one  two  three  four  five  six
0    1   10    100  1000    11   55
1    2   20    200  2000    22   66
2    3   30    300  3000    33   77
3    4   40    400  4000    44   88

using a existing column

In [46]:
d2['seven'] = d2['one'] + 100
d2

   one  two  three  four  five  six  seven
0    1   10    100  1000    11   55    101
1    2   20    200  2000    22   66    102
2    3   30    300  3000    33   77    103
3    4   40    400  4000    44   88    104

deleting a column

using del

In [47]:
del d2['seven']
d2

   one  two  three  four  five  six
0    1   10    100  1000    11   55
1    2   20    200  2000    22   66
2    3   30    300  3000    33   77
3    4   40    400  4000    44   88

using pop

In [48]:
d2.pop('five')
d2

   one  two  three  four  six
0    1   10    100  1000   55
1    2   20    200  2000   66
2    3   30    300  3000   77
3    4   40    400  4000   88

appending of rows

In [49]:
d1 = pd.DataFrame({'a':[1,2],'b':[3,4]})
d2 = pd.DataFrame({'a':[5,6],'b':[7,8]})       #column names should be same for both
d1.append(d2).reset_index(drop = True)

C:\Users\SNEHA\AppData\Local\Temp\ipykernel_2476\863514903.py:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  d1.append(d2).reset_index(drop = True)

   a  b
0  1  3
1  2  4
2  5  7
3  6  8

drop function

In [50]:
d = {'one':[1,2,3,4],
    'two' : [10,20,30,40],
    'three' :[100,200,300,400],
    'four' :[1000,2000,3000,4000]}
d2 = pd.DataFrame(d)

dropping rows : axis = 0

In [51]:
d2.drop([1,2], axis=0)       #by default axis is taken 0

   one  two  three  four
0    1   10    100  1000
3    4   40    400  4000

dropping columns : axis = 1

In [52]:
d2.drop(['three'],axis = 1)

   one  two  four
0    1   10  1000
1    2   20  2000
2    3   30  3000
3    4   40  4000

Transposing a dataframe : making rows as columns and columns as rows

In [53]:
d = {'one':[1,2,3,4],
    'two' : [10,20,30,40],
    'three' :[100,200,300,400],
    'four' :[1000,2000,3000,4000]}
d2 = pd.DataFrame(d)
d2

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [54]:
d2.T

          0     1     2     3
one       1     2     3     4
two      10    20    30    40
three   100   200   300   400
four   1000  2000  3000  4000

more dataframe functions

axes : gives dataframe rows index range and column names

In [55]:
d2.axes

[RangeIndex(start=0, stop=4, step=1),
 Index(['one', 'two', 'three', 'four'], dtype='object')]

ndim : gives dimension of data

In [56]:
d2.ndim     # 2d since rows and columns #series is 1d since it is just a list

2

dtypes : gives datatype of data in each column

In [57]:
d2.dtypes

one      int64
two      int64
three    int64
four     int64
dtype: object

shape : shape of data frame i.e rows and columns number

In [58]:
d2.shape

(4, 4)

head() function : gives first 5 rows of data  frame by default

In [59]:
d = {'one':[1,2,3,4,5,6,7,8,9],
    'two' : [10,20,30,40,50,60,70,80,90],
    'three' :[100,200,300,400,500,600,700,800,900],
    'four' :[1000,2000,3000,4000,5000,6000,7000,8000,9000]}
d2 = pd.DataFrame(d)

d2

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000
4    5   50    500  5000
5    6   60    600  6000
6    7   70    700  7000
7    8   80    800  8000
8    9   90    900  9000

In [60]:
d2.head()

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000
4    5   50    500  5000

In [61]:
d2.head(2)

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000

tail() function : gives last 5 rows by default

In [62]:
d2.tail()

   one  two  three  four
4    5   50    500  5000
5    6   60    600  6000
6    7   70    700  7000
7    8   80    800  8000
8    9   90    900  9000

In [63]:
d2.tail(3)

   one  two  three  four
6    7   70    700  7000
7    8   80    800  8000
8    9   90    900  9000

empty function : returns true if dataframe is empty else returns false

In [64]:
d2.empty

False

## statistical or mathematical functions

sum : sum of each column

In [65]:
d2.sum()

one         45
two        450
three     4500
four     45000
dtype: int64

sum of a particular column

In [66]:
d2['one'].sum()

45

similarly we have mean, median, mode, variance, min, max, standard deviation

In [67]:
d2.mean()

one         5.0
two        50.0
three     500.0
four     5000.0
dtype: float64

In [68]:
d2.median()

one         5.0
two        50.0
three     500.0
four     5000.0
dtype: float64

In [69]:
d2.mode()       # here since every value is different, it printed whole dataframe, else it will print mode

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000
4    5   50    500  5000
5    6   60    600  6000
6    7   70    700  7000
7    8   80    800  8000
8    9   90    900  9000

In [70]:
d2.var()

one            7.5
two          750.0
three      75000.0
four     7500000.0
dtype: float64

In [71]:
d2.min()

one         1
two        10
three     100
four     1000
dtype: int64

In [72]:
d2.max()

one         9
two        90
three     900
four     9000
dtype: int64

In [73]:
d2.std()

one         2.738613
two        27.386128
three     273.861279
four     2738.612788
dtype: float64

#### describe function : gives some basic info about dataframe like number of values in each column, their min, max, standard deviation, etc

In [74]:
d2.describe()

            one        two       three         four
count  9.000000   9.000000    9.000000     9.000000
mean   5.000000  50.000000  500.000000  5000.000000
std    2.738613  27.386128  273.861279  2738.612788
min    1.000000  10.000000  100.000000  1000.000000
25%    3.000000  30.000000  300.000000  3000.000000
50%    5.000000  50.000000  500.000000  5000.000000
75%    7.000000  70.000000  700.000000  7000.000000
max    9.000000  90.000000  900.000000  9000.000000

### Pipe functions

pipe function : it applies a certain function to every element of the data frame

In [75]:
d = {'one':[1,2,3,4,5],
    'two' : [10,20,30,40,50],
    'three' :[100,200,300,400,500],
    'four' :[1000,2000,3000,4000,5000]}
d2 = pd.DataFrame(d)
d2

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000
4    5   50    500  5000

In [76]:
def squared_(ele):
    return ele**2

In [77]:
d2.pipe(squared_)

   one   two   three      four
0    1   100   10000   1000000
1    4   400   40000   4000000
2    9   900   90000   9000000
3   16  1600  160000  16000000
4   25  2500  250000  25000000

you can also apply column-wise and row wise functions

In [78]:
def mean_(ele):
    return ele.mean()

In [79]:
d2.pipe(mean_)      #takes mean of every column

one         3.0
two        30.0
three     300.0
four     3000.0
dtype: float64

apply function : works same as pipe except pipe allows to chain multiple operations while apply doesn't

In [80]:
d2.apply(squared_)

   one   two   three      four
0    1   100   10000   1000000
1    4   400   40000   4000000
2    9   900   90000   9000000
3   16  1600  160000  16000000
4   25  2500  250000  25000000

In [81]:
d2.apply(mean_)

one         3.0
two        30.0
three     300.0
four     3000.0
dtype: float64

applymap function : same as apply except it can't persorm row-wise and column-wise thus the mean function won't work here

In [82]:
d2.applymap(squared_)

   one   two   three      four
0    1   100   10000   1000000
1    4   400   40000   4000000
2    9   900   90000   9000000
3   16  1600  160000  16000000
4   25  2500  250000  25000000

Reindex function : changes index of rows or labels of columns

In [83]:
d2

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000
4    5   50    500  5000

In [84]:
d3 = d2.reindex([2,3,1,0],columns = ['four','one','two','three'])
d3

   four  one  two  three
2  3000    3   30    300
3  4000    4   40    400
1  2000    2   20    200
0  1000    1   10    100

renaming columns and row indices

In [85]:
print(d2)
d2 = d2.rename(columns = {'one':'seven','two':'eight'})
d2

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000
4    5   50    500  5000

   seven  eight  three  four
0      1     10    100  1000
1      2     20    200  2000
2      3     30    300  3000
3      4     40    400  4000
4      5     50    500  5000

In [86]:
d2 = d2.rename(index = {0:'a',1:'b'})
d2

   seven  eight  three  four
a      1     10    100  1000
b      2     20    200  2000
2      3     30    300  3000
3      4     40    400  4000
4      5     50    500  5000

sorting

sort wrt a particular column

In [87]:
d3

   four  one  two  three
2  3000    3   30    300
3  4000    4   40    400
1  2000    2   20    200
0  1000    1   10    100

In [91]:
d3.sort_values(by =['two'], kind = 'quicksort')    #by default kind is taken as merge sort

   four  one  two  three
0  1000    1   10    100
1  2000    2   20    200
2  3000    3   30    300
3  4000    4   40    400

Group by function : makes groups

In [102]:
cricket = pd.DataFrame({'Team' : ['India','India','Australia','Australia','SA','SA','SA','SA','NZ','NZ','NZ','India'],
                       'Rank' : [2,3,1,2,3,4,1,1,2,4,1,2],
                       'Year' : [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017]})
cricket

         Team  Rank  Year
0       India     2  2014
1       India     3  2015
2   Australia     1  2014
3   Australia     2  2015
4          SA     3  2014
5          SA     4  2015
6          SA     1  2016
7          SA     1  2017
8          NZ     2  2016
9          NZ     4  2014
10         NZ     1  2015
11      India     2  2017

In [103]:
cricket.groupby('Team').groups        #the list is indices at which team is present

{'Australia': [2, 3], 'India': [0, 1, 11], 'NZ': [8, 9, 10], 'SA': [4, 5, 6, 7]}

to search for a specific group

In [105]:
cricket.groupby('Team').get_group('India')

     Team  Rank  Year
0   India     2  2014
1   India     3  2015
11  India     2  2017

to search for a spexifix country and a specific year

In [108]:
cricket.groupby(['Team','Year']).get_group(('India',2014))

    Team  Rank  Year
0  India     2  2014

adding some statistical computation

In [114]:
cricket.groupby('Team')['Year'].median()

Team
Australia    2014.5
India        2015.0
NZ           2015.0
SA           2015.5
Name: Year, dtype: float64

filter function along with groupby

In [119]:
cricket.groupby('Team').filter(lambda x : len(x)==4)

  Team  Rank  Year
4   SA     3  2014
5   SA     4  2015
6   SA     1  2016
7   SA     1  2017

### working with csv files

reading a csv file

In [124]:
d = pd.read_csv('https://github.com/AshishJangra27/In-One-Go/blob/main/Pandas/Football.csv')

ParserError: Error tokenizing data. C error: Expected 1 fields in line 30, saw 367